In [1]:
# Some highlits from stepik course 'Основы Pandas для начинающих' Автор: Роман Медведев 
# ссылка: https://stepik.org/course/120014/info

# Курс супер! Очень рекомендую всем для того, чтобы освежить знания.

In [1]:
import pandas as pd
import numpy as np

In [4]:
pd. __version__

'1.5.3'

In [ ]:
# На основе словаря создайте датафрейм с индексами user1, user2, user3, user4
# def solution():
#     data = {'user' : ['Ivan', 'Petr', 'Nikolay', 'Andrey'], 
#             'time_per_page' :  [10, 30 , 15, 5], 
#              'pages' : [7, 9, 12, 3]}
#     result = #ваш код здесь
#     return result

In [40]:
data = {'user' : ['Ivan', 'Petr', 'Nikolay', 'Andrey'], 
            'time_per_page' :  [10, 30 , 15, 5], 
             'pages' : [7, 9, 12, 3]}

df = pd.DataFrame(data, index = ['user1', 'user2', 'user3', 'user4'])

In [10]:
df

          user  time_per_page  pages
user1     Ivan             10      7
user2     Petr             30      9
user3  Nikolay             15     12
user4   Andrey              5      3

In [ ]:
# Добавьте в датафрейм новую колонку с названием total_time, 
# и присвойте ей произведение значений из столбцов time_per_page и pages. 
# Функция должна вернуть итоговый датафрейм.

In [12]:
df['total_time'] = df.time_per_page*df.pages

In [13]:
df

          user  time_per_page  pages  total_time
user1     Ivan             10      7          70
user2     Petr             30      9         270
user3  Nikolay             15     12         180
user4   Andrey              5      3          15

In [14]:
# добавьте в датафрейм столбец balance, который будет хранить информацию о балансе из серии.

In [15]:
s1 = pd.Series([200, 300], index = ['user3', 'user4'])

In [16]:
df['balance'] = s1

In [17]:
df

          user  time_per_page  pages  total_time  balance
user1     Ivan             10      7          70      NaN
user2     Petr             30      9         270      NaN
user3  Nikolay             15     12         180    200.0
user4   Andrey              5      3          15    300.0

In [ ]:
# Найдите индексы строк, где баланс не подтянулся. На выходе функция должна вернуть объект Index

In [23]:
df.index[np.isnan(df.balance)]

# result = df[df['balance'].isnull()].index # isnull

# result = df[df.balance.isna()].index # isna()

Index(['user1', 'user2'], dtype='object')

In [ ]:
# Создайте новую колонку c названием is_correct. 
# Проверьте каждое значение из столбца total_time. 
# Если значение меньше 100, то в колонку is_correct вставьте True, а иначе False. 
# Функция должна вернуть датафрейм с внесёнными изменениями.

In [27]:
df['is_correct'] = np.zeros((4,1), dtype = bool)

In [28]:
df

          user  time_per_page  pages  total_time  balance  is_correct
user1     Ivan             10      7          70      NaN       False
user2     Petr             30      9         270      NaN       False
user3  Nikolay             15     12         180    200.0       False
user4   Andrey              5      3          15    300.0       False

In [31]:
df['is_correct'] = np.where(df.total_time <100, True, False)

In [32]:
df

          user  time_per_page  pages  total_time  balance  is_correct
user1     Ivan             10      7          70      NaN        True
user2     Petr             30      9         270      NaN       False
user3  Nikolay             15     12         180    200.0       False
user4   Andrey              5      3          15    300.0        True

In [33]:
df['test'] = 6

In [34]:
df

          user  time_per_page  pages  total_time  balance  is_correct  test
user1     Ivan             10      7          70      NaN        True     6
user2     Petr             30      9         270      NaN       False     6
user3  Nikolay             15     12         180    200.0       False     6
user4   Andrey              5      3          15    300.0        True     6

In [36]:
del df['test']

In [37]:
df

          user  time_per_page  pages  total_time  balance  is_correct
user1     Ivan             10      7          70      NaN        True
user2     Petr             30      9         270      NaN       False
user3  Nikolay             15     12         180    200.0       False
user4   Andrey              5      3          15    300.0        True

In [38]:
df.T

              user1  user2    user3   user4
user           Ivan   Petr  Nikolay  Andrey
time_per_page    10     30       15       5
pages             7      9       12       3
total_time       70    270      180      15
balance         NaN    NaN    200.0   300.0
is_correct     True  False    False    True

In [39]:
df

          user  time_per_page  pages  total_time  balance  is_correct
user1     Ivan             10      7          70      NaN        True
user2     Petr             30      9         270      NaN       False
user3  Nikolay             15     12         180    200.0       False
user4   Andrey              5      3          15    300.0        True

In [40]:
df.values

array([['Ivan', 10, 7, 70, nan, True],
       ['Petr', 30, 9, 270, nan, False],
       ['Nikolay', 15, 12, 180, 200.0, False],
       ['Andrey', 5, 3, 15, 300.0, True]], dtype=object)

In [44]:
df.index

Index(['user1', 'user2', 'user3', 'user4'], dtype='object')

In [56]:
df.index[0]

'user1'

### Перезапись индексов и колонок

In [46]:
df.index[0] = 'uz' # не поддерживает пеерзапись по одному индексу

TypeError: Index does not support mutable operations

In [47]:
df.index = [1,2,3,4] # индексы переименовываются целиком все перезаписываются

In [48]:
df

      user  time_per_page  pages  total_time  balance  is_correct
1     Ivan             10      7          70      NaN        True
2     Petr             30      9         270      NaN       False
3  Nikolay             15     12         180    200.0       False
4   Andrey              5      3          15    300.0        True

In [42]:
df.columns

Index(['user', 'time_per_page', 'pages', 'total_time', 'balance',
       'is_correct'],
      dtype='object')

In [49]:
df.columns[0]

'user'

In [50]:
df.columns[0] = 'uzer' # то же самое с колонками

TypeError: Index does not support mutable operations

### labels for pd.index

In [51]:
df.index

Int64Index([1, 2, 3, 4], dtype='int64')

In [52]:
labels = pd.Index(['user1', 'user2', 'user3', 'user4'])

In [53]:
df.index = labels

In [54]:
df

          user  time_per_page  pages  total_time  balance  is_correct
user1     Ivan             10      7          70      NaN        True
user2     Petr             30      9         270      NaN       False
user3  Nikolay             15     12         180    200.0       False
user4   Andrey              5      3          15    300.0        True

In [57]:
'user1' in labels

True

### Перевод индексов и колонок в верхний_нижний регистр и работа со строками

In [58]:
df

          user  time_per_page  pages  total_time  balance  is_correct
user1     Ivan             10      7          70      NaN        True
user2     Petr             30      9         270      NaN       False
user3  Nikolay             15     12         180    200.0       False
user4   Andrey              5      3          15    300.0        True

In [61]:
df.columns = df.columns.str.upper()

In [62]:
df

          USER  TIME_PER_PAGE  PAGES  TOTAL_TIME  BALANCE  IS_CORRECT
user1     Ivan             10      7          70      NaN        True
user2     Petr             30      9         270      NaN       False
user3  Nikolay             15     12         180    200.0       False
user4   Andrey              5      3          15    300.0        True

In [63]:
df.index = df.index.str.upper()

In [64]:
df

          USER  TIME_PER_PAGE  PAGES  TOTAL_TIME  BALANCE  IS_CORRECT
USER1     Ivan             10      7          70      NaN        True
USER2     Petr             30      9         270      NaN       False
USER3  Nikolay             15     12         180    200.0       False
USER4   Andrey              5      3          15    300.0        True

In [278]:
df

     col_1  col_2  col_3  col_4  col_5
0     Ivan     25      4     50      1
1     Petr     40      9    250      8
2  Nikolay     19     12     25      1
3   Sergey     33      6    115      6
4   Andrey     38      2    152      4
5     Ilya     20     18     15      2
6     Igor     19      2     10      1

In [281]:
df.columns = df.columns.str.lstrip('col_')

In [282]:
df

         1   2   3    4  5
0     Ivan  25   4   50  1
1     Petr  40   9  250  8
2  Nikolay  19  12   25  1
3   Sergey  33   6  115  6
4   Andrey  38   2  152  4
5     Ilya  20  18   15  2
6     Igor  19   2   10  1

### Разные типы индексов у df и s

In [105]:
s = pd.Series([1,2,3], index = ['1', '2', '3']) # здесь индексы строковые

In [106]:
s

1    1
2    2
3    3
dtype: int64

In [107]:
s.index

Index(['1', '2', '3'], dtype='object')

In [108]:
df = pd.DataFrame({'a':{1: 1111, 2: 2222, 3: 3333}}) # здесь те же индекссы int

In [109]:
df

      a
1  1111
2  2222
3  3333

In [110]:
df['new_column'] = s # так как индексы разного типа - всё заменяется на nan

In [111]:
df

      a  new_column
1  1111         NaN
2  2222         NaN
3  3333         NaN

In [112]:
# меняем тип индексов в серии:

s.index = s.index.astype('int64')

In [113]:
s.index

Int64Index([1, 2, 3], dtype='int64')

In [114]:
s

1    1
2    2
3    3
dtype: int64

In [115]:
df.index

Int64Index([1, 2, 3], dtype='int64')

In [116]:
df

      a  new_column
1  1111         NaN
2  2222         NaN
3  3333         NaN

In [ ]:
# Теперь тип индексов одинаковый - и колонка добавляется с правильными значениями

In [117]:
df['new_column'] = s

In [118]:
df

      a  new_column
1  1111           1
2  2222           2
3  3333           3

In [122]:
df['new_column']

1    1
2    2
3    3
Name: new_column, dtype: int64

In [123]:
df['new_column'][1]

1

# Функции reindex, drop и индексация в датафрейме

In [254]:
data = [['Ivan', 25, 4, 50, 1], 
        ['Petr', 40, 9, 250, 8],
        ['Nikolay', 19, 12, 25, 1],
        ['Sergey', 33, 6, 115, 6],
        ['Andrey', 38, 2, 152, 4],
        ['Ilya', 20, 18, 15, 2],
        ['Igor', 19, 2, 10, 1]]
df = pd.DataFrame(data)

In [134]:
df

         0   1   2    3  4
0     Ivan  25   4   50  1
1     Petr  40   9  250  8
2  Nikolay  19  12   25  1
3   Sergey  33   6  115  6
4   Andrey  38   2  152  4
5     Ilya  20  18   15  2
6     Igor  19   2   10  1

### reindex берет только те строки, которые указываем, остальные не берет

In [130]:
df.reindex([0, 1, 2]) # по умаолчанию axis = 0 - DataFrame сворачивается в ноль.

         0   1   2    3  4
0     Ivan  25   4   50  1
1     Petr  40   9  250  8
2  Nikolay  19  12   25  1

In [131]:
df.reindex([0, 1, 2], axis = 0) # - DataFrame сворачивается в ноль.

         0   1   2    3  4
0     Ivan  25   4   50  1
1     Petr  40   9  250  8
2  Nikolay  19  12   25  1

In [132]:
df.reindex([0, 1, 2], axis = 1) # когда axis = 1 - DataFrame - сворачивается в единицу |

         0   1   2
0     Ivan  25   4
1     Petr  40   9
2  Nikolay  19  12
3   Sergey  33   6
4   Andrey  38   2
5     Ilya  20  18
6     Igor  19   2

In [ ]:
Если задавать столбец или строку, которой не существует - они добавяться со значениями nan

In [ ]:
drop - удаяет из области видимости то, что не нужно - всё остальное остается

In [136]:
df

         0   1   2    3  4
0     Ivan  25   4   50  1
1     Petr  40   9  250  8
2  Nikolay  19  12   25  1
3   Sergey  33   6  115  6
4   Andrey  38   2  152  4
5     Ilya  20  18   15  2
6     Igor  19   2   10  1

In [137]:
df.drop([0,1,2,3,4,5]) # по умолчанию axis = 0 - всё сворачивается в ноль

      0   1  2   3  4
6  Igor  19  2  10  1

In [139]:
df.drop([1,2,3,4], axis = 0)

      0   1   2   3  4
0  Ivan  25   4  50  1
5  Ilya  20  18  15  2
6  Igor  19   2  10  1

In [140]:
df.drop([1,2,3,4], axis = 1) # - при axis = 1 - всё сворачивается в единицу

         0
0     Ivan
1     Petr
2  Nikolay
3   Sergey
4   Andrey
5     Ilya
6     Igor

In [141]:
df.drop([1], axis = 1)

         0   2    3  4
0     Ivan   4   50  1
1     Petr   9  250  8
2  Nikolay  12   25  1
3   Sergey   6  115  6
4   Andrey   2  152  4
5     Ilya  18   15  2
6     Igor   2   10  1

In [142]:
df.drop(1, axis = 1)

         0   2    3  4
0     Ivan   4   50  1
1     Petr   9  250  8
2  Nikolay  12   25  1
3   Sergey   6  115  6
4   Andrey   2  152  4
5     Ilya  18   15  2
6     Igor   2   10  1

In [ ]:
df.drop([1,2,3], axis = 1, inplace = False/True) # можно удалять прямо из существующего df

### Индексация в DataFrame

In [145]:
# индексация в серии

s = pd.Series([1,2,3,4], index = ['a', 'b', 'c', 'd'])

In [146]:
s

a    1
b    2
c    3
d    4
dtype: int64

In [147]:
s[0]

1

In [148]:
s[1]

2

In [149]:
s[:2]

a    1
b    2
dtype: int64

In [150]:
s[::-1]

d    4
c    3
b    2
a    1
dtype: int64

In [151]:
s

a    1
b    2
c    3
d    4
dtype: int64

In [152]:
s[['b', 'a', 'd']] # вложенный массив fancy index

b    2
a    1
d    4
dtype: int64

In [154]:
s[[1, 0,3]] # вложенный массив fancy index

b    2
a    1
d    4
dtype: int64

In [155]:
s

a    1
b    2
c    3
d    4
dtype: int64

In [156]:
s>2

a    False
b    False
c     True
d     True
dtype: bool

In [157]:
mask = s>2

In [158]:
s[mask]

c    3
d    4
dtype: int64

In [159]:
s[[True, True, False, False]]

a    1
b    2
dtype: int64

In [160]:
s[s>2]

c    3
d    4
dtype: int64

In [161]:
s

a    1
b    2
c    3
d    4
dtype: int64

In [162]:
s['a':'c'] # слайсинг по индексам включает в себя все указанные индексы

a    1
b    2
c    3
dtype: int64

In [ ]:
s['a':'c'] = 9999

In [169]:
s

a    9999
b    9999
c    9999
d       4
dtype: int64

### Подключаем df

In [168]:
df

         0   1   2    3  4
0     Ivan  25   4   50  1
1     Petr  40   9  250  8
2  Nikolay  19  12   25  1
3   Sergey  33   6  115  6
4   Andrey  38   2  152  4
5     Ilya  20  18   15  2
6     Igor  19   2   10  1

In [170]:
df[[0,4]]

         0  4
0     Ivan  1
1     Petr  8
2  Nikolay  1
3   Sergey  6
4   Andrey  4
5     Ilya  2
6     Igor  1

In [ ]:
df[0] - по индексам не работает

In [172]:
df[0:1] - задо работает по слайсингам ??

      0   1  2   3  4
0  Ivan  25  4  50  1

In [173]:
df[[True, True, False, False, False, False, False, ]] # дает использовать булевую маску

      0   1  2    3  4
0  Ivan  25  4   50  1
1  Petr  40  9  250  8

In [ ]:
ЭТО ДАЕТ ВОЗМОЖНОСТЬ ВЫТЯГИВАТЬ ТОЛЬКО ТЕ СТРОЧКИ, КОТОРЫЕ ЗАВЯЗАНЫ НА КАКОМ-ТО УСЛОВИИ

In [174]:
df

         0   1   2    3  4
0     Ivan  25   4   50  1
1     Petr  40   9  250  8
2  Nikolay  19  12   25  1
3   Sergey  33   6  115  6
4   Andrey  38   2  152  4
5     Ilya  20  18   15  2
6     Igor  19   2   10  1

In [255]:
# Для удобства переименуем колонки

df.columns = pd.Index(['col_1' , 'col_2' , 'col_3' , 'col_4' , 'col_5'] )

In [180]:
df

     col_1  col_2  col_3  col_4  col_5
0     Ivan     25      4     50      1
1     Petr     40      9    250      8
2  Nikolay     19     12     25      1
3   Sergey     33      6    115      6
4   Andrey     38      2    152      4
5     Ilya     20     18     15      2
6     Igor     19      2     10      1

In [181]:
df.col_2>20

0     True
1     True
2    False
3     True
4     True
5    False
6    False
Name: col_2, dtype: bool

In [182]:
df[df.col_2>20]

    col_1  col_2  col_3  col_4  col_5
0    Ivan     25      4     50      1
1    Petr     40      9    250      8
3  Sergey     33      6    115      6
4  Andrey     38      2    152      4

In [186]:
df[0:2]

  col_1  col_2  col_3  col_4  col_5
0  Ivan     25      4     50      1
1  Petr     40      9    250      8

In [187]:
df

     col_1  col_2  col_3  col_4  col_5
0     Ivan     25      4     50      1
1     Petr     40      9    250      8
2  Nikolay     19     12     25      1
3   Sergey     33      6    115      6
4   Andrey     38      2    152      4
5     Ilya     20     18     15      2
6     Igor     19      2     10      1

In [192]:
df[['col_2', 'col_3', 'col_4', 'col_5']] >30

   col_2  col_3  col_4  col_5
0  False  False   True  False
1   True  False   True  False
2  False  False  False  False
3   True  False   True  False
4   True  False   True  False
5  False  False  False  False
6  False  False  False  False

In [195]:
df[['col_2', 'col_3', 'col_4', 'col_5']][df[['col_2', 'col_3', 'col_4', 'col_5']] >30] = 0

C:\Users\roman\AppData\Local\Temp\ipykernel_26028\3325118682.py:1: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame.
Try using .loc[row_indexer,col_indexer] = value instead

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  df[['col_2', 'col_3', 'col_4', 'col_5']][df[['col_2', 'col_3', 'col_4', 'col_5']] >30] = 0
C:\Users\roman\AppData\Local\Temp\ipykernel_26028\3325118682.py:1: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  df[['col_2', 'col_3', 'col_4', 'col_5']][df[['col_2', 'col_3', 'col_4', 'col_5']] >30] = 0

In [237]:
df

     col_1  col_2  col_3  col_4  col_5
0     Ivan     25      4     50      1
1     Petr     40      9    250      8
2  Nikolay     19     12     25      1
3   Sergey     33      6    115      6
4   Andrey     38      2    152      4
5     Ilya     20     18     15      2
6     Igor     19      2     10      1

In [238]:
df1 = df.drop('col_1', axis = 1)

In [220]:
print(df1)

   col_2  col_3  col_4  col_5
0     25      4     50      1
1     40      9    250      8
2     19     12     25      1
3     33      6    115      6
4     38      2    152      4
5     20     18     15      2
6     19      2     10      1

In [226]:
df1[df1>30] = 0

In [227]:
df1

   col_2  col_3  col_4  col_5
0     25      4      0      1
1      0      9      0      8
2     19     12     25      1
3      0      6      0      6
4      0      2      0      4
5     20     18     15      2
6     19      2     10      1

In [239]:
df1[~(df1<30)] = 100

In [240]:
df1

   col_2  col_3  col_4  col_5
0     25      4    100      1
1    100      9    100      8
2     19     12     25      1
3    100      6    100      6
4    100      2    100      4
5     20     18     15      2
6     19      2     10      1

In [248]:
df

     col_1  col_2  col_3  col_4  col_5
0     Ivan     25      4     50      1
1     Petr     40      9    250      8
2  Nikolay     19     12     25      1
3   Sergey     33      6    115      6
4   Andrey     38      2    152      4
5     Ilya     20     18     15      2
6     Igor     19      2     10      1

In [249]:
mask = df.col_5 >5

In [250]:
df[df.col_5 >5]

    col_1  col_2  col_3  col_4  col_5
1    Petr     40      9    250      8
3  Sergey     33      6    115      6

In [251]:
df[mask]

    col_1  col_2  col_3  col_4  col_5
1    Petr     40      9    250      8
3  Sergey     33      6    115      6

In [252]:
df[mask] = 10000

In [253]:
df

     col_1  col_2  col_3  col_4  col_5
0     Ivan     25      4     50      1
1    10000  10000  10000  10000  10000
2  Nikolay     19     12     25      1
3    10000  10000  10000  10000  10000
4   Andrey     38      2    152      4
5     Ilya     20     18     15      2
6     Igor     19      2     10      1

In [263]:
df

     col_1  col_2  col_3  col_4  col_5
0     Ivan     25      4     50      1
1     Petr     40      9    250      8
2  Nikolay     19     12     25      1
3   Sergey     33      6    115      6
4   Andrey     38      2    152      4
5     Ilya     20     18     15      2
6     Igor     19      2     10      1

In [264]:
df.col_1[df.col_5>5]

1      Petr
3    Sergey
Name: col_1, dtype: object

In [261]:
df[df.col_5>5]

    col_1  col_2  col_3  col_4  col_5
1    Petr     40      9    250      8
3  Sergey     33      6    115      6

In [259]:
df[['col_1', 'col_2']][df.col_5>5]

    col_1  col_2
1    Petr     40
3  Sergey     33

In [265]:
df

     col_1  col_2  col_3  col_4  col_5
0     Ivan     25      4     50      1
1     Petr     40      9    250      8
2  Nikolay     19     12     25      1
3   Sergey     33      6    115      6
4   Andrey     38      2    152      4
5     Ilya     20     18     15      2
6     Igor     19      2     10      1

In [266]:
df.col_2.mean()

27.714285714285715

In [267]:
df[df.col_2 > df.col_2.mean()]

    col_1  col_2  col_3  col_4  col_5
1    Petr     40      9    250      8
3  Sergey     33      6    115      6
4  Andrey     38      2    152      4

# Практика

In [ ]:
#проверка на наличие строки с определенным лейблом

In [269]:
df

     col_1  col_2  col_3  col_4  col_5
0     Ivan     25      4     50      1
1     Petr     40      9    250      8
2  Nikolay     19     12     25      1
3   Sergey     33      6    115      6
4   Andrey     38      2    152      4
5     Ilya     20     18     15      2
6     Igor     19      2     10      1

In [270]:
0 in df

False

In [274]:
0 in df.index

True

In [ ]:
# проверка на наличие колонки с определенным названием

In [273]:
'col_1' in df.columns

True

In [ ]:
# проверка на оба условия - и строка и колонка

In [276]:
result = (0 in df.index) & ('col_1' in df.columns)

In [277]:
result

True

In [283]:
df

         1   2   3    4  5
0     Ivan  25   4   50  1
1     Petr  40   9  250  8
2  Nikolay  19  12   25  1
3   Sergey  33   6  115  6
4   Andrey  38   2  152  4
5     Ilya  20  18   15  2
6     Igor  19   2   10  1

In [289]:
df.columns = pd.Index(['a', 'b', 'c', 'd', 'e'])

In [290]:
df

         a   b   c    d  e
0     Ivan  25   4   50  1
1     Petr  40   9  250  8
2  Nikolay  19  12   25  1
3   Sergey  33   6  115  6
4   Andrey  38   2  152  4
5     Ilya  20  18   15  2
6     Igor  19   2   10  1

In [291]:
df.reindex([5,6]).reindex(['d', 'e'], axis = 1)

    d  e
5  15  2
6  10  1

In [292]:
df

         a   b   c    d  e
0     Ivan  25   4   50  1
1     Petr  40   9  250  8
2  Nikolay  19  12   25  1
3   Sergey  33   6  115  6
4   Andrey  38   2  152  4
5     Ilya  20  18   15  2
6     Igor  19   2   10  1

In [293]:
df.a[df.b>30]

1      Petr
3    Sergey
4    Andrey
Name: a, dtype: object

In [294]:
df.columns = pd.Index(['name', 'age', 'clicks', 'balance', 'history'])

In [295]:
df

      name  age  clicks  balance  history
0     Ivan   25       4       50        1
1     Petr   40       9      250        8
2  Nikolay   19      12       25        1
3   Sergey   33       6      115        6
4   Andrey   38       2      152        4
5     Ilya   20      18       15        2
6     Igor   19       2       10        1

In [299]:
# определите пользователей у которых баланс больше 100. Возьмите две колонки name и age.

df[['name', 'age']][df.balance>100]

     name  age
1    Petr   40
3  Sergey   33
4  Andrey   38

In [302]:
# выберите из датафрейма записи, если имя пользователя Petr или Andrey. 
# От получившегося датафрейма возьмите три столбца: name, age, balance: 

df[['name', 'age', 'balance']][(df.name == 'Petr') | (df.name == 'Andrey')]

     name  age  balance
1    Petr   40      250
4  Andrey   38      152

In [305]:
# обнулить баланс для пользователей у которых баланс меньше 100. 
# Отредактируйте колонку balance.

df.balance[df.balance<100] = 0 # если делать так, то баланс обнуляется, но вылазить ошибка

C:\Users\roman\AppData\Local\Temp\ipykernel_26028\1842984458.py:4: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  df.balance[df.balance<100] = 0

In [307]:
df

      name  age  clicks  balance  history
0     Ivan   25       4        0        1
1     Petr   40       9      250        8
2  Nikolay   19      12        0        1
3   Sergey   33       6      115        6
4   Andrey   38       2      152        4
5     Ilya   20      18        0        2
6     Igor   19       2        0        1

In [308]:
data = [['Ivan', 25, 4, 50, 1], 
        ['Petr', 40, 9, 250, 8],
        ['Nikolay', 19, 12, 25, 1],
        ['Sergey', 33, 6, 115, 6],
        ['Andrey', 38, 2, 152, 4],
        ['Ilya', 20, 18, 15, 2],
        ['Igor', 19, 2, 10, 1]]
df = pd.DataFrame(data)

df.columns = pd.Index(['name', 'age', 'clicks', 'balance', 'history'])

In [310]:
df

      name  age  clicks  balance  history
0     Ivan   25       4       50        1
1     Petr   40       9      250        8
2  Nikolay   19      12       25        1
3   Sergey   33       6      115        6
4   Andrey   38       2      152        4
5     Ilya   20      18       15        2
6     Igor   19       2       10        1

In [311]:
df.balance = np.where(df.balance < 100, 0, df.balance)

In [312]:
df

      name  age  clicks  balance  history
0     Ivan   25       4        0        1
1     Petr   40       9      250        8
2  Nikolay   19      12        0        1
3   Sergey   33       6      115        6
4   Andrey   38       2      152        4
5     Ilya   20      18        0        2
6     Igor   19       2        0        1

# Операторы loc[], iloc[], at[], iat[]. Сложение нескольких датафреймов

### Оператор .loc

In [313]:
df

      name  age  clicks  balance  history
0     Ivan   25       4        0        1
1     Petr   40       9      250        8
2  Nikolay   19      12        0        1
3   Sergey   33       6      115        6
4   Andrey   38       2      152        4
5     Ilya   20      18        0        2
6     Igor   19       2        0        1

In [314]:
df.loc[[0,1,2], ['name', 'age']]

      name  age
0     Ivan   25
1     Petr   40
2  Nikolay   19

In [318]:
df.loc[:, ['age']]

   age
0   25
1   40
2   19
3   33
4   38
5   20
6   19

In [320]:
df.loc[df.age>30, ['name', 'age']]

     name  age
1    Petr   40
3  Sergey   33
4  Andrey   38

In [322]:
# Также оператор .loc поддерживает слайсинги

In [327]:
df.loc[0:3, ]

      name  age  clicks  balance  history
0     Ivan   25       4        0        1
1     Petr   40       9      250        8
2  Nikolay   19      12        0        1
3   Sergey   33       6      115        6

In [328]:
df.loc[0:2, ['name', 'history']]

      name  history
0     Ivan        1
1     Petr        8
2  Nikolay        1

### оператор .iloc

In [ ]:
Работает также как оператор .loc, но вытягивает значения не по лэйблам, а по индексам

In [334]:
df.iloc[1]

name       Petr
age          40
clicks        9
balance     250
history       8
Name: 1, dtype: object

In [333]:
df.iloc[[1]]

   name  age  clicks  balance  history
1  Petr   40       9      250        8

In [330]:
df.iloc[[1,2]]

      name  age  clicks  balance  history
1     Petr   40       9      250        8
2  Nikolay   19      12        0        1

In [335]:
df.iloc[[0,1,2], [2,3]]

   clicks  balance
0       4        0
1       9      250
2      12        0

### Оператор .at и .iat

In [ ]:
# Операторы .at и .iat - это урезанные версии операторов .loc и .iloc

# Но они работают с единичными лейблами (не принмает несколько строк или несколько колонок)

# эти операторы работают быстрее...

In [338]:
df.at[0, 'name']

'Ivan'

In [345]:
df.iat[0, 0]

'Ivan'

In [346]:
# Также при помощи этих операторов можно перезаписывать значнеия в df

In [347]:
df

      name  age  clicks  balance  history
0     Ivan   25       4        0        1
1     Petr   40       9      250        8
2  Nikolay   19      12        0        1
3   Sergey   33       6      115        6
4   Andrey   38       2      152        4
5     Ilya   20      18        0        2
6     Igor   19       2        0        1

In [350]:
df.at[0, 'name'] = 'Vasuok'

In [351]:
df

      name  age  clicks  balance  history
0   Vasuok   25       4        0        1
1     Petr   40       9      250        8
2  Nikolay   19      12        0        1
3   Sergey   33       6      115        6
4   Andrey   38       2      152        4
5     Ilya   20      18        0        2
6     Igor   19       2        0        1

In [ ]:
# также работает и loc

In [352]:
df

      name  age  clicks  balance  history
0   Vasuok   25       4        0        1
1     Petr   40       9      250        8
2  Nikolay   19      12        0        1
3   Sergey   33       6      115        6
4   Andrey   38       2      152        4
5     Ilya   20      18        0        2
6     Igor   19       2        0        1

In [353]:
df.loc[[0,1], ['name', 'age']] = -999999

In [354]:
df

      name     age  clicks  balance  history
0  -999999 -999999       4        0        1
1  -999999 -999999       9      250        8
2  Nikolay      19      12        0        1
3   Sergey      33       6      115        6
4   Andrey      38       2      152        4
5     Ilya      20      18        0        2
6     Igor      19       2        0        1

In [363]:
df.loc[[5,6,7]] # при попытке передать несуществующую строку в loc будет ошибка

KeyError: '[7] not in index'

### Сложение нескольких датафреймов

In [357]:
df1 = pd.DataFrame(np.arange(9).reshape(3, 3), columns=list('bcd'), index=['Moscow', 'Kazan', 'Vladivostok'])

df2 = pd.DataFrame(np.arange(12).reshape(4, 3), columns=list('bde'), index=['Yakutsk', 'Moscow', 'Kazan', 'Ufa'])

In [358]:
df1

             b  c  d
Moscow       0  1  2
Kazan        3  4  5
Vladivostok  6  7  8

In [359]:
df2

         b   d   e
Yakutsk  0   1   2
Moscow   3   4   5
Kazan    6   7   8
Ufa      9  10  11

In [360]:
df1 + df2 # логика в том, что выполняется всё, что совпадает. Для остального - значнеия NAN
# matchig происходит и по строке и по столбцу

               b   c     d   e
Kazan        9.0 NaN  12.0 NaN
Moscow       3.0 NaN   6.0 NaN
Ufa          NaN NaN   NaN NaN
Vladivostok  NaN NaN   NaN NaN
Yakutsk      NaN NaN   NaN NaN

In [364]:
df

      name  age  clicks  balance  history
0     Ivan   25       4       50        1
1     Petr   40       9      250        8
2  Nikolay   19      12       25        1
3   Sergey   33       6      115        6
4   Andrey   38       2      152        4
5     Ilya   20      18       15        2
6     Igor   19       2       10        1

In [369]:
df.loc[0] + df.loc[1]

name       IvanPetr
age              65
clicks           13
balance         300
history           9
dtype: object

In [370]:
df.iloc[-1]

name       Igor
age          19
clicks        2
balance      10
history       1
Name: 6, dtype: object

In [3]:
df1 = pd.DataFrame({'visits': [200, np.nan , 500]}, index= ['Msk', 'SPb', 'Ptz'])

In [377]:
df1

     visits
Msk   200.0
SPb     NaN
Ptz   500.0

In [4]:
df2 = pd.DataFrame({'visits': [100, 200 , 300]}, index= ['Msk', 'SPb', 'Ptz'])

In [379]:
df2

     visits
Msk     100
SPb     200
Ptz     300

In [380]:
df1 + df2

     visits
Msk   300.0
SPb     NaN
Ptz   800.0

In [383]:
df1.add(df2)

     visits
Msk   300.0
SPb     NaN
Ptz   800.0

In [384]:
df1.add(df2, fill_value=0)

     visits
Msk   300.0
SPb   200.0
Ptz   800.0

In [19]:
df2.add(df1, fill_value=100)

     visits    year
Msk   300.0  2100.0
SPb   300.0  2101.0
Ptz   800.0  2102.0

In [ ]:
# fill_value= ... работает только если одно из значений NaN. Если два значения NaN, то fill_value не вступает в игру)

In [75]:
df2

     visits  year
Msk     100  2000
SPb     200  2001
Ptz     300  2002

In [76]:
df3 = df2.T

In [77]:
df3

         Msk   SPb   Ptz
visits   100   200   300
year    2000  2001  2002

In [78]:
df2+df3

        Msk  Ptz  SPb  visits  year
Msk     NaN  NaN  NaN     NaN   NaN
Ptz     NaN  NaN  NaN     NaN   NaN
SPb     NaN  NaN  NaN     NaN   NaN
visits  NaN  NaN  NaN     NaN   NaN
year    NaN  NaN  NaN     NaN   NaN

In [79]:
df2.add(df3, fill_value=0)

           Msk     Ptz     SPb  visits    year
Msk        NaN     NaN     NaN   100.0  2000.0
Ptz        NaN     NaN     NaN   300.0  2002.0
SPb        NaN     NaN     NaN   200.0  2001.0
visits   100.0   300.0   200.0     NaN     NaN
year    2000.0  2002.0  2001.0     NaN     NaN

In [80]:
df3.add(df2, fill_value=0)

           Msk     Ptz     SPb  visits    year
Msk        NaN     NaN     NaN   100.0  2000.0
Ptz        NaN     NaN     NaN   300.0  2002.0
SPb        NaN     NaN     NaN   200.0  2001.0
visits   100.0   300.0   200.0     NaN     NaN
year    2000.0  2002.0  2001.0     NaN     NaN

In [ ]:
# Сложнение серии и df. Происходит по названиям колонок с одинаковыми названиями.

In [13]:
ser = pd.Series([1,2], index = ['visits', 'year'])

In [15]:
df2['year'] = [2000, 2001, 2002]

In [17]:
df2

     visits  year
Msk     100  2000
SPb     200  2001
Ptz     300  2002

In [27]:
df2+ser # во всю колонку добавляются значения df с соответсвующим названием

     visits  year
Msk     101  2002
SPb     201  2003
Ptz     301  2004

In [24]:
# Для такого же сложения, но по оси строк используется df.add
df2

     visits  year
Msk     100  2000
SPb     200  2001
Ptz     300  2002

In [25]:
ser_2 = pd.Series([1], index = ['Msk'])

In [28]:
df1.add(ser_2, axis=0)

     visits
Msk   201.0
Ptz     NaN
SPb     NaN

# Сортировка

In [31]:
s = pd.Series([1,2,3,4,5,6,7], index = ['e', 'f', 'g', 'a', 'b', 'c', 'd'])

In [32]:
s

e    1
f    2
g    3
a    4
b    5
c    6
d    7
dtype: int64

In [34]:
s.sort_index() # в прямом порядке (ascending = True)

a    4
b    5
c    6
d    7
e    1
f    2
g    3
dtype: int64

In [36]:
s.sort_index(ascending=False) # в обратном порядке

g    3
f    2
e    1
d    7
c    6
b    5
a    4
dtype: int64

In [38]:
s.sort_values()

e    1
f    2
g    3
a    4
b    5
c    6
d    7
dtype: int64

In [49]:
s.sort_values(ascending = False)

d    7
c    6
b    5
a    4
g    3
f    2
e    1
dtype: int64

### Сортировка датафрейма

In [51]:
data = {'user' : ['Ivan', 'Petr', 'Nikolay', 'Andrey'], 
            'time_per_page' :  [10, 30 , 15, 5], 
             'pages' : [7, 9, 12, 3]}

df = pd.DataFrame(data, index = ['user3', 'user2', 'user1', 'user4'])

In [52]:
df

          user  time_per_page  pages
user3     Ivan             10      7
user2     Petr             30      9
user1  Nikolay             15     12
user4   Andrey              5      3

In [53]:
 df.drop('user', axis = 1, inplace=True)

In [54]:
df

       time_per_page  pages
user3             10      7
user2             30      9
user1             15     12
user4              5      3

In [55]:
df.sort_index() # по умолчанию axis = 0 - сортируются индексы строк

       time_per_page  pages
user1             15     12
user2             30      9
user3             10      7
user4              5      3

In [56]:
df.sort_index(axis=1)

       pages  time_per_page
user3      7             10
user2      9             30
user1     12             15
user4      3              5

In [63]:
data = [['Ivan', 25, 4, 50, 1], 
        ['Petr', 40, 9, 250, 8],
        ['Nikolay', 19, 12, 25, 1],
        ['Sergey', 33, 6, 115, 6],
        ['Andrey', 38, 2, 152, 4],
        ['Ilya', 20, 18, 15, 2],
        ['Igor', 19, 2, 10, 1]]
df = pd.DataFrame(data)
df.columns = pd.Index(['col_1' , 'col_2' , 'col_3' , 'col_4' , 'col_5'] )

In [64]:
df

     col_1  col_2  col_3  col_4  col_5
0     Ivan     25      4     50      1
1     Petr     40      9    250      8
2  Nikolay     19     12     25      1
3   Sergey     33      6    115      6
4   Andrey     38      2    152      4
5     Ilya     20     18     15      2
6     Igor     19      2     10      1

In [65]:
df.sort_values(by='col_2') # сортировка по отдельной колонке

     col_1  col_2  col_3  col_4  col_5
2  Nikolay     19     12     25      1
6     Igor     19      2     10      1
5     Ilya     20     18     15      2
0     Ivan     25      4     50      1
3   Sergey     33      6    115      6
4   Andrey     38      2    152      4
1     Petr     40      9    250      8

In [68]:
df.sort_values(by=['col_2', 'col_3'])

     col_1  col_2  col_3  col_4  col_5
6     Igor     19      2     10      1
2  Nikolay     19     12     25      1
5     Ilya     20     18     15      2
0     Ivan     25      4     50      1
3   Sergey     33      6    115      6
4   Andrey     38      2    152      4
1     Petr     40      9    250      8

# Описательные статистики. Уникальные значения

# Свойство is_unique

In [70]:
df.index = [0, 0, 0, 3,4,5,6] # переименуем строки, так, чтобы некоторые лэйблы повторялись

In [71]:
df

     col_1  col_2  col_3  col_4  col_5
0     Ivan     25      4     50      1
0     Petr     40      9    250      8
0  Nikolay     19     12     25      1
3   Sergey     33      6    115      6
4   Andrey     38      2    152      4
5     Ilya     20     18     15      2
6     Igor     19      2     10      1

In [72]:
df.index.is_unique

False

In [81]:
df = pd.DataFrame({'visits_2021' : [100, 200, 300, 50, 40],
                   'visits_2020' : [90, 100, np.nan, 10, 80],
                   'visits_2019' : [10, np.nan, 20, 16, 80]}, index=['Moscow', 'Kazan', 'Ufa', 'Yakutsk', 'Novosibirsk'])

In [82]:
df

             visits_2021  visits_2020  visits_2019
Moscow               100         90.0         10.0
Kazan                200        100.0          NaN
Ufa                  300          NaN         20.0
Yakutsk               50         10.0         16.0
Novosibirsk           40         80.0         80.0

In [83]:
df.sum() # axis = 0 по умолчанию

visits_2021    690.0
visits_2020    280.0
visits_2019    126.0
dtype: float64

In [84]:
df.sum(axis=1)

Moscow         200.0
Kazan          300.0
Ufa            320.0
Yakutsk         76.0
Novosibirsk    200.0
dtype: float64

In [85]:
df.mean()

visits_2021    138.0
visits_2020     70.0
visits_2019     31.5
dtype: float64

In [87]:
df.sum(skipna = False) # по умолчанию параметр skipna установлен в True и функции игнорируют Nan

visits_2021    690.0
visits_2020      NaN
visits_2019      NaN
dtype: float64

# Сводная информация по df и Series

In [89]:
df.describe() # работает только на столбцах, если надо по строкам - надо применять .T

       visits_2021  visits_2020  visits_2019
count     5.000000     4.000000     4.000000
mean    138.000000    70.000000    31.500000
std     110.544109    40.824829    32.593455
min      40.000000    10.000000    10.000000
25%      50.000000    62.500000    14.500000
50%     100.000000    85.000000    18.000000
75%     200.000000    92.500000    35.000000
max     300.000000   100.000000    80.000000

In [90]:
s = pd.Series(['a','s','a', 'f', 'g', 'a'])

In [91]:
s.describe()

count     6
unique    4
top       a
freq      3
dtype: object

In [92]:
s.unique()

array(['a', 's', 'f', 'g'], dtype=object)

In [94]:
s.value_counts()

a    3
s    1
f    1
g    1
dtype: int64

In [96]:
s.isin(['a'])

0     True
1    False
2     True
3    False
4    False
5     True
dtype: bool

In [ ]:
# то же самое можно применять для df

In [97]:
data = [['Ivan', 25, 4, 50, 1], 
        ['Petr', 40, 9, 250, 8],
        ['Nikolay', 19, 12, 25, 1],
        ['Sergey', 33, 6, 115, 6],
        ['Andrey', 38, 2, 152, 4],
        ['Ilya', 20, 18, 15, 2],
        ['Igor', 19, 2, 10, 1]]
df = pd.DataFrame(data)
df.columns = pd.Index(['col_1' , 'col_2' , 'col_3' , 'col_4' , 'col_5'] )

In [98]:
df

     col_1  col_2  col_3  col_4  col_5
0     Ivan     25      4     50      1
1     Petr     40      9    250      8
2  Nikolay     19     12     25      1
3   Sergey     33      6    115      6
4   Andrey     38      2    152      4
5     Ilya     20     18     15      2
6     Igor     19      2     10      1

In [100]:
df['col_1'].isin(['Igor', 'Petr']) # - это является маской, можем по ней вытягивать строки из df

0    False
1     True
2    False
3    False
4    False
5    False
6     True
Name: col_1, dtype: bool

In [101]:
df[df['col_1'].isin(['Igor', 'Petr'])]

  col_1  col_2  col_3  col_4  col_5
1  Petr     40      9    250      8
6  Igor     19      2     10      1